'''
Метод: search
'''

import re

string = "Нільс Бор народився в родині професора фізіології Копенгагенського університету Християна Бора (1858-1911), "\
         "й Еллен Адлер (1860—1930). Батьки Бора одружилися 1881 року. Батька Нільса Бора двічі висували кандидатом "\
         "на Нобелівську премію з фізіології або медицини[6]. Мати була донькою впливового та вельми заможного "\
         "єврейського банкіра і парламентаря-ліберала Давида Баруха Адлера[da] (1826—1878) і Дженні Рафаел (1830—1902) "\
         "із британської єврейської банкірської династії Raphael Raphael & sons[en][7]."

pattern = r'[0-9]+'
result = re.search(pattern, string)  # ищет первое вхождение
# метод span() возвращает кортеж с индексами для среза
print(type(result))
print(result.span())
first_index, second_index = result.span()
# print(string[first_index:second_index])

# эквивалентно string[first_index:second_index]
print(result.group())
