'''
Задача
Метод: finditer
'''

import re

string = "Нільс Бор народився в родині професора фізіології Копенгагенського університету Християна Бора (1858-1911), " \
         "й Еллен Адлер (1860-1930). Батьки Бора одружилися 1881 року. Батька Нільса Бора двічі висували кандидатом " \
         "на Нобелівську премію з фізіології або медицини[6]. Мати була донькою впливового та вельми заможного " \
         "єврейського банкіра і парламентаря-ліберала Давида Баруха Адлера[da] (1826-1878) і Дженні Рафаел (1830-1902) " \
         "із британської єврейської банкірської династії Raphael Raphael & sons[en][7]."

# ?: - квантифікатор
pattern = r'(\d{4})-(\d{4})'
result = re.findall(pattern, string)
print(result)

# повертає результат на кожній ітерації
iterator = re.finditer(pattern, string)
r_list = []
for match in iterator:
    r_list.append(match.group())
print(r_list)
